gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762_RouterActive.c


#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/RM_3762_RouterActive.h"
#include "../DL698/Uart_3762_RxTx.h"
#include "../DL698/RM_RS485.h"
#include "../DL698/TASK.h"
#include "../DL698/RM_TASK.h"
#include "../DL698/RM_TxDATA.h"
#include "../DL698/RM_RxDATA.h"
#include "../DL698/RM_Record.h"

#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/MEMRW.h"
#include "../Display/Warning.h"
#include "../Calculate/Calculate.h"






#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=

void Uart_3762_AFN14F1_Tx(u32 PORTn,u32 RMFlag)//路由器请求抄表返回帧;入口:RMFlag抄读标志=0抄读失败,=1抄读成功,2=抄读
{
	u32 x;
	u8 * p8rx;
	u8 * p8tx;
	UARTCtrl_TypeDef * UARTCtrl;

	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);

	if(Terminal_Router->RouterRunMode_1==2)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
	{
		p8tx[3]=0x03;//控制码;集中式路由载波通信
	}
	else
	{
		if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
		{
			p8tx[3]=0x0a;//控制码;微功率无线通信
		}
		else
		{
			p8tx[3]=0x01;//控制码;集中式路由载波通信
		}
	}
	p8tx[4]=4;//通信模块标识=1
	MR(((u32)p8tx)+10,(u32)&Terminal_Router->RouterAddr,6);//主节点地址(源地址)
	MR(((u32)p8tx)+16,((u32)p8rx)+14,6);//从节点地址(目的地址)
	p8tx[22]=0x14;//AFN=0x14
	p8tx[23]=0x01;//Fn=1
	p8tx[24]=0x00;//Fn=1
	p8tx[25]=RMFlag;//抄读标志=0抄读失败,=1抄读成功,2=抄读
	p8tx[26]=0;//通信延时相关性标志,0=无关,1=有关
	p8tx[27]=0;//DL645帧长度=0
	p8tx[28]=0;//附属节点数量N=0
	x=29+2;//需总发送字节数
	p8tx[1]=x;
	p8tx[2]=x>>8;
	UARTCtrl->TxByte=x;//发送字节数(半字对齐)

//	switch(Comm_Ram->RouterType)//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=
//	{
//		default://其他
//		case 2://鼎信
//			break;
//		case 3://东软
//			p8tx[4]=0x0;//通信模块标识=0
//			MR(((u32)p8tx)+10,((u32)p8tx)+22,7);
//			x=17+2;//需总发送字节数
//			p8tx[1]=x;
//			p8tx[2]=x>>8;
//			UARTCtrl->TxByte=x;//发送字节数(半字对齐)
//			break;
//	}

	Uart_3762_CS((u32)p8tx);//和校验计算并写入和比较,返回0=正确1=错误,入口接收或发送缓冲
	UARTCtrl->Task=3;//等待发送			
	UARTCtrl->TxToRxTimerOver=0;//1000/10//发送后接收超时定时值=0,使能很快超时而转空闲以便数据转发
}

void Get_ReRMCount(u32 PORTn)//得到抄表重发计数,取入到UARTCtrl->ReRMCount
{
	u32 i;
	u32 id;
	u32 m;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	RMokfailLIST_TypeDef *rmOKFAILlist;
  UARTCtrl_TypeDef* UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UARTCtrl->ReRMCount=0;//连续重发次数计数
	id=UARTCtrl->TaskID;
	if(id==0)
	{
		return;
	}
	id>>=8;
	id&=0xff;
	if(id>=(RMTASKmax+ExtRMTASKmax))
	{
		return;
	}
	Addr0=UARTCtrl->RMAddr[0];
	Addr1=UARTCtrl->RMAddr[1];
	Addr2=UARTCtrl->RMAddr[2];
	//查原是否失败记录
	m=UARTCtrl->NUMrmFAIL[id];//各任务已采集失败电能表数
	if(m>NUM_RMmax)
	{
		m=NUM_RMmax;
	}
	rmOKFAILlist=UARTCtrl->rmOKFAILlist[id+1];
	rmOKFAILlist--;
	for(i=0;i<m;i++)
	{
		if(rmOKFAILlist->Addr0==Addr0)
		{
			if(rmOKFAILlist->Addr1==Addr1)
			{
				if(rmOKFAILlist->Addr2==Addr2)
				{
					UARTCtrl->ReRMCount=rmOKFAILlist->ReRMCount;//连继重发次数计数
					return;
				}
			}
		}
		rmOKFAILlist--;
	}
}

void Save_ReRMCount(u32 PORTn)//存贮抄表重发计数,将UARTCtrl->ReRMCount写入到失败列表
{
	u32 i;
	u32 id;
	u32 n;
	u32 m;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	RMokfailLIST_TypeDef *rmOKFAILlist;
  UARTCtrl_TypeDef* UARTCtrl;

	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	id=UARTCtrl->TaskID;
	if(id==0)
	{
		return;
	}
	id>>=8;
	id&=0xff;
	if(id>=(RMTASKmax+ExtRMTASKmax))
	{
		return;
	}
	Addr0=UARTCtrl->RMAddr[0];
	Addr1=UARTCtrl->RMAddr[1];
	Addr2=UARTCtrl->RMAddr[2];
	n=UARTCtrl->NUMrmOK[id];
	if(n>=NUM_RMmax)
	{
		return;
	}
	m=UARTCtrl->NUMrmFAIL[id];//各任务已采集失败电能表数
	if((n+m)>NUM_RMmax)
	{
		m=NUM_RMmax-n;//各任务已采集失败电能表数
	}
	
	
////---test 抄表失败计数列表----
//	
//	if(UARTCtrl->ReRMCount==1)
//	{
//		id=id;
//	}
//	p8=(u8*)ADDR_Event_Sour;
//	rmOKFAILlist=UARTCtrl->rmOKFAILlist[id+1];
//	rmOKFAILlist--;
//	for(i=0;i<m;i++)
//	{
//		p8[0]=rmOKFAILlist->ReRMCount;
//		p8++;
//		rmOKFAILlist--;
//	}
////----test end------------
	
	
	
	//查原是否失败记录
	rmOKFAILlist=UARTCtrl->rmOKFAILlist[id+1];
	rmOKFAILlist--;
	for(i=0;i<m;i++)
	{
		if(rmOKFAILlist->Addr0==Addr0)
		{
			if(rmOKFAILlist->Addr1==Addr1)
			{
				if(rmOKFAILlist->Addr2==Addr2)
				{
					rmOKFAILlist->ReRMCount=UARTCtrl->ReRMCount;//连继重发次数计数
					return;
				}
			}
		}
		rmOKFAILlist--;
	}
	m++;
	if((n+m)>NUM_RMmax)
	{
		return;
	}
	UARTCtrl->NUMrmFAIL[id]=m;//各任务已采集失败电能表数
	rmOKFAILlist->Addr0=Addr0;
	rmOKFAILlist->Addr1=Addr1;
	rmOKFAILlist->Addr2=Addr2;
	rmOKFAILlist->ReRMCount=UARTCtrl->ReRMCount;//连继重发次数计数

}

void Clr_RMListRMCount(u32 ListNo)//清抄表计数相关数据;入口:ListNo=列表号从0开始
{
	RMLIST->List[ListNo].CONNECT=0;//DL698连接:0=空,1=启动连接，2=，100=连接,101=抄表中,102=关闭连接
	RMLIST->List[ListNo].RMprotocol=0;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
	RMLIST->List[ListNo].RMCSDCount=0;//抄表CSD计数
	RMLIST->List[ListNo].RMROADCount=0;//抄表CSD的ROAD内关联的OAD计数(非DL698抄表时)
	RMLIST->List[ListNo].RMCSDSubCount=0;//抄表CSD子计数(非DL698抄表时)
	RMLIST->List[ListNo].RMCSDCountMax=0;//抄表CSD最大个数
	RMLIST->List[ListNo].RMROADCountMax=0;//抄表CSD的ROAD内有关联的OAD最大个数(非DL698抄表规约库设定)
	RMLIST->List[ListNo].RMCSDSubCountMax=0;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
	RMLIST->List[ListNo].RMROADCountOK=0;//抄表写文件数据缓冲中ROAD时已填入关联的OAD数据个数计数
	RMLIST->List[ListNo].TASK=0;//并发任务:0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送)
	RMLIST->List[ListNo].TIMER_S=0;//并发启动发送后等待接收秒定时
	//TxSEQ;//并发启动发送帧序号
	RMLIST->List[ListNo].RM_OKFAIL=0;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
	RMLIST->List[ListNo].RM_DI_CHOICE=0;//抄表DI选择:0=主DI,1=备用DI
	RMLIST->List[ListNo].RM_DI=0;//DL/T645-2007/1997当前抄表数据标识
	RMLIST->List[ListNo].RM_DI_TI_Count=0;//按时标间隔采集时的间隔计数
	RMLIST->List[ListNo].RM_SubsequentFrames=0;//0=无读后续帧,1-n=读续帧的帧号
	RMLIST->List[ListNo].RMOADROAD=0;//抄表任务有抄过的OAD类型:b0=有OAD,b1=有ROAD,b3-b7保留;用于抄表数据存贮时是存在RAM还是NAND

//抄表数据缓冲1,最大总长度=LEN_RM_DI_CSD
//0 6byte 电能表地址
//6 2byte 长度=时标+已采集的CSD(不包括本身2字节)
//8 7byte 采集启动时标  date_time_s(无数据类型)
//15 7byte 采集成功时标  date_time_s(无数据类型)
//22 7byte 采集存储时标  date_time_s(无数据类型)
//29  采集的CSD  array CSD(有数据类型)

//抄表数据缓冲2,最大总长度=LEN_UARTnFnDataBuff-LEN_RM_DI_CSD
//LEN_RM_DI_CSD   2byte 长度=已填写入buff但还没完整一个CSD的长度(不包括本身2字节)
//LEN_RM_DI_CSD+2 2byte 长度=已填写入buff完整CSD的长度(不包括本身2字节)
//LEN_RM_DI_CSD+4 采集的数据(有数据类型,全部数据为单独顺序排列无总数组)
	RMLIST->List[ListNo].FnDataBuff[6]=0;//长度=时标+已采集的CSD(不包括本身2字节)
	RMLIST->List[ListNo].FnDataBuff[7]=0;
	RMLIST->List[ListNo].FnDataBuff[LEN_RM_DI_CSD+0]=0;//长度=已填写入buff但还没完整一个CSD的长度(不包括本身2字节)
	RMLIST->List[ListNo].FnDataBuff[LEN_RM_DI_CSD+1]=0;
	RMLIST->List[ListNo].FnDataBuff[LEN_RM_DI_CSD+2]=0;//长度=已填写入buff完整CSD的长度(不包括本身2字节)
	RMLIST->List[ListNo].FnDataBuff[LEN_RM_DI_CSD+3]=0;
}


void ClrALL_RMListRMCount(void)//清全部抄表计数相关数据(载波口)
{
	u32 i;
	for(i=0;i<NUM_RMLISTmax;i++)
	{
		Clr_RMListRMCount(i);//清抄表计数相关数据;入口:ListNo=列表号从0开始
	}
}

