gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762_RouterActive.c
#if NUM_RMLISTmax<NUM_RMmax//载波路由主动抄表时用的最大抄表能缓存个数(抄表计数、已抄数据填入等)
u32 Get_RMListNO_Tx(u16* p16Addr)//得到当前抄表地址的列表号0-(NUM_RMLISTmax-1),当原没列表时自动分配列表号并初始化相关计数值
{
	u32 i;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	
	Addr0=p16Addr[0];
	Addr1=p16Addr[1];
	Addr2=p16Addr[2];
	for(i=0;i<NUM_RMLISTmax;i++)
	{
		if(Addr0==RMLIST->List[i].RMAddr[0])
		{
			if(Addr1==RMLIST->List[i].RMAddr[1])
			{
				if(Addr2==RMLIST->List[i].RMAddr[2])
				{
					return i;
				}
			}
		}
	}
	i=Terminal_Router->RMListCount;//抄表地址的列表号自动分配计数0-(NUM_RMLISTmax-1)
	if(i>=NUM_RMLISTmax)
	{
		i=0;
	}
	Terminal_Router->RMListCount=i+1;//抄表地址的列表号自动分配计数0-(NUM_RMLISTmax-1)
	Clr_RMListRMCount(i);//清抄表计数相关数据;入口:ListNo=列表号从0开始
	RMLIST->List[i].RMAddr[0]=Addr0;
	RMLIST->List[i].RMAddr[1]=Addr1;
	RMLIST->List[i].RMAddr[2]=Addr2;
	return i;
}
u32 Get_RMListNO_Rx(u16* p16Addr)//得到当前抄表地址的列表号0-(NUM_RMLISTmax-1),当原没列表时返回:NUM_RMLISTmax表示无效
{
	u32 i;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	
	Addr0=p16Addr[0];
	Addr1=p16Addr[1];
	Addr2=p16Addr[2];
	for(i=0;i<NUM_RMLISTmax;i++)
	{
		if(Addr0==RMLIST->List[i].RMAddr[0])
		{
			if(Addr1==RMLIST->List[i].RMAddr[1])
			{
				if(Addr2==RMLIST->List[i].RMAddr[2])
				{
					return i;
				}
			}
		}
	}
	return NUM_RMLISTmax;//返回:NUM_RMLISTmax表示无效
}
#endif


void Load_RMCount_NoCompAddr(u32 PORTn,u32 ListNo)//得到抄表计数相关数据(不比较地址);入口:ListNo=列表号从0开始
{
	u32 i;
	u32 x;
	u8* p8;
  UARTCtrl_TypeDef* UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UARTCtrl->CONNECT=RMLIST->List[ListNo].CONNECT;//DL698连接:0=空,1=启动连接，2=，100=连接,101=抄表中,102=关闭连接
	UARTCtrl->RMprotocol=RMLIST->List[ListNo].RMprotocol;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
	UARTCtrl->RMCSDCount=RMLIST->List[ListNo].RMCSDCount;//抄表CSD计数
	UARTCtrl->RMROADCount=RMLIST->List[ListNo].RMROADCount;//抄表CSD的ROAD内关联的OAD计数(非DL698抄表时)
	UARTCtrl->RMCSDSubCount=RMLIST->List[ListNo].RMCSDSubCount;//抄表CSD子计数(非DL698抄表时)
	UARTCtrl->RMCSDCountMax=RMLIST->List[ListNo].RMCSDCountMax;//抄表CSD最大个数
	UARTCtrl->RMROADCountMax=RMLIST->List[ListNo].RMROADCountMax;//抄表CSD的ROAD内有关联的OAD最大个数(非DL698抄表规约库设定)
	UARTCtrl->RMCSDSubCountMax=RMLIST->List[ListNo].RMCSDSubCountMax;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
	UARTCtrl->RMROADCountOK=RMLIST->List[ListNo].RMROADCountOK;//抄表写文件数据缓冲中ROAD时已填入关联的OAD数据个数计数
//	RMLIST->List[ListNo].TASK=0;//并发任务:0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送)
//	RMLIST->List[ListNo].TIMER_S=0;//并发启动发送后等待接收秒定时
	Get_ReRMCount(PORTn);//得到抄表重发计数,取入到UARTCtrl->ReRMCount
	UARTCtrl->RM_OKFAIL=RMLIST->List[ListNo].RM_OKFAIL;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
	UARTCtrl->RM_DI_CHOICE=RMLIST->List[ListNo].RM_DI_CHOICE;//抄表DI选择:0=主DI,1=备用DI
	UARTCtrl->RM_DI=RMLIST->List[ListNo].RM_DI;//DL/T645-2007/1997当前抄表数据标识
	UARTCtrl->RM_DI_TI_Count=RMLIST->List[ListNo].RM_DI_TI_Count;//按时标间隔采集时的间隔计数
	UARTCtrl->RM_SubsequentFrames=RMLIST->List[ListNo].RM_SubsequentFrames;//0=无读后续帧,1-n=读续帧的帧号
	UARTCtrl->RMOADROAD=RMLIST->List[ListNo].RMOADROAD;//抄表任务有抄过的OAD类型:b0=有OAD,b1=有ROAD,b3-b7保留;用于抄表数据存贮时是存在RAM还是NAND
	UARTCtrl->res23=RMLIST->List[ListNo].res23;
	//UARTCtrl->MinuteCollect=RMLIST->List[ListNo].MinuteCollect;

	for(i=0;i<8;i++)
	{
		UARTCtrl->RM_Rx_date_time_s[i]=RMLIST->List[ListNo].RM_Rx_date_time_s[i];//抄表接收到的数据时标(无数据类型),7byte,仅为对齐定义8byte
	}
	for(i=0;i<10;i++)
	{
		UARTCtrl->RM_Rx_date_40020200[i]=RMLIST->List[ListNo].RM_Rx_date_40020200[i];//抄表接收到的数据事件次暂存及用于MAC验证的电能表表号;0th=状态(0=空,1=正在抄,2=完成),1th=表号长度(<=6),2th-7th表号值
	}
	for(i=0;i<16;i++)
	{
		UARTCtrl->Rand[i]=RMLIST->List[ListNo].Rand[i];//抄表安全模式时发送给电表的16字节随机数
	}
	for(i=0;i<LEN_RMCSD;i++)
	{
		UARTCtrl->RMCSD[i]=RMLIST->List[ListNo].RMCSD[i];//128-x byte 当前正在抄的CSD(有数据类型)
	}
	
//FnData
	//i=Get_ADDR_UARTnFnDataBuff(PORTn);
	//MR(i,(u32)&RMLIST->List[ListNo].FnDataBuff,LEN_UART4FnDataBuff);
//抄表数据缓冲1,最大总长度=LEN_RM_DI_CSD
//0 6byte 电能表地址
//6 2byte 长度=时标+已采集的CSD(不包括本身2字节)
//8 7byte 采集启动时标  date_time_s(无数据类型)
//15 7byte 采集成功时标  date_time_s(无数据类型)
//22 7byte 采集存储时标  date_time_s(无数据类型)
//29  采集的CSD  array CSD(有数据类型)
	p8=(u8*)Get_ADDR_UARTnFnDataBuff(PORTn);
	i=RMLIST->List[ListNo].FnDataBuff[6];//长度=时标+已采集的CSD(不包括本身2字节)
	i|=RMLIST->List[ListNo].FnDataBuff[7]<<8;
	i+=8;
	if(i>LEN_RM_DI_CSD)
	{
		i=LEN_RM_DI_CSD;
	}
	MR((u32)p8,(u32)&RMLIST->List[ListNo].FnDataBuff,i);
//抄表数据缓冲2,最大总长度=LEN_UARTnFnDataBuff-LEN_RM_DI_CSD
//LEN_RM_DI_CSD   2byte 长度=已填写入buff但还没完整一个CSD的长度(不包括本身2字节)
//LEN_RM_DI_CSD+2 2byte 长度=已填写入buff完整CSD的长度(不包括本身2字节)
//LEN_RM_DI_CSD+4 采集的数据(有数据类型,全部数据为单独顺序排列无总数组)
	i=RMLIST->List[ListNo].FnDataBuff[LEN_RM_DI_CSD];
	i|=RMLIST->List[ListNo].FnDataBuff[LEN_RM_DI_CSD+1]<<8;
	x=RMLIST->List[ListNo].FnDataBuff[LEN_RM_DI_CSD+2];
	x|=RMLIST->List[ListNo].FnDataBuff[LEN_RM_DI_CSD+3]<<8;
	i+=x;
	i+=4;
	if(i>(LEN_UART4FnDataBuff-LEN_RM_DI_CSD))
	{
		i=LEN_UART4FnDataBuff-LEN_RM_DI_CSD;
	}
	MR((u32)p8+LEN_RM_DI_CSD,(u32)&RMLIST->List[ListNo].FnDataBuff+LEN_RM_DI_CSD,i);
}

void Load_RMCount_CompAddr(u32 PORTn,u32 ListNo)//得到抄表计数相关数据(比较地址);入口:ListNo=列表号从0开始
{
	u32 i;
  UARTCtrl_TypeDef* UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	for(i=0;i<3;i++)
	{
		if(UARTCtrl->RMAddr[i]!=RMLIST->List[ListNo].RMAddr[i])
		{//地址变化
			Clr_RMListRMCount(ListNo);//清抄表计数相关数据;入口:ListNo=列表号从0开始
			for(i=0;i<3;i++)
			{
				RMLIST->List[ListNo].RMAddr[i]=UARTCtrl->RMAddr[i];
			}
			break;
		}
	}
	Load_RMCount_NoCompAddr(PORTn,ListNo);//得到抄表计数相关数据(不比较地址);入口:ListNo=列表号从0开始
}

void Save_RMCount(u32 PORTn,u32 ListNo)//保存抄表计数相关数据;入口:ListNo=列表号从0开始
{
	u32 i;
	u32 x;
	u8* p8;
  UARTCtrl_TypeDef* UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	RMLIST->List[ListNo].CONNECT=UARTCtrl->CONNECT;//DL698连接:0=空,1=启动连接，2=，100=连接,101=抄表中,102=关闭连接
	RMLIST->List[ListNo].RMprotocol=UARTCtrl->RMprotocol;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
	RMLIST->List[ListNo].RMCSDCount=UARTCtrl->RMCSDCount;//抄表CSD计数
	RMLIST->List[ListNo].RMROADCount=UARTCtrl->RMROADCount;//抄表CSD的ROAD内关联的OAD计数(非DL698抄表时)
	RMLIST->List[ListNo].RMCSDSubCount=UARTCtrl->RMCSDSubCount;//抄表CSD子计数(非DL698抄表时)
	RMLIST->List[ListNo].RMCSDCountMax=UARTCtrl->RMCSDCountMax;//抄表CSD最大个数
	RMLIST->List[ListNo].RMROADCountMax=UARTCtrl->RMROADCountMax;//抄表CSD的ROAD内有关联的OAD最大个数(非DL698抄表规约库设定)
	RMLIST->List[ListNo].RMCSDSubCountMax=UARTCtrl->RMCSDSubCountMax;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
	RMLIST->List[ListNo].RMROADCountOK=UARTCtrl->RMROADCountOK;//抄表写文件数据缓冲中ROAD时已填入关联的OAD数据个数计数
//	RMLIST->List[ListNo].TASK=0;//并发任务:0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送)
//	RMLIST->List[ListNo].TIMER_S=0;//并发启动发送后等待接收秒定时
	Save_ReRMCount(PORTn);//存贮抄表重发计数,将UARTCtrl->ReRMCount写入到失败列表
	RMLIST->List[ListNo].RM_OKFAIL=UARTCtrl->RM_OKFAIL;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
	RMLIST->List[ListNo].RM_DI_CHOICE=UARTCtrl->RM_DI_CHOICE;//抄表DI选择:0=主DI,1=备用DI
	RMLIST->List[ListNo].RM_DI=UARTCtrl->RM_DI;//DL/T645-2007/1997当前抄表数据标识
	RMLIST->List[ListNo].RM_DI_TI_Count=UARTCtrl->RM_DI_TI_Count;//按时标间隔采集时的间隔计数
	RMLIST->List[ListNo].RM_SubsequentFrames=UARTCtrl->RM_SubsequentFrames;//0=无读后续帧,1-n=读续帧的帧号
	RMLIST->List[ListNo].RMOADROAD=UARTCtrl->RMOADROAD;//抄表任务有抄过的OAD类型:b0=有OAD,b1=有ROAD,b3-b7保留;用于抄表数据存贮时是存在RAM还是NAND

	for(i=0;i<8;i++)
	{
		RMLIST->List[ListNo].RM_Rx_date_time_s[i]=UARTCtrl->RM_Rx_date_time_s[i];//抄表接收到的数据时标(无数据类型),7byte,仅为对齐定义8byte
	}
	for(i=0;i<10;i++)
	{
		RMLIST->List[ListNo].RM_Rx_date_40020200[i]=UARTCtrl->RM_Rx_date_40020200[i];//抄表接收到的数据事件次暂存及用于MAC验证的电能表表号;0th=状态(0=空,1=正在抄,2=完成),1th=表号长度(<=6),2th-7th表号值
	}
	for(i=0;i<16;i++)
	{
		RMLIST->List[ListNo].Rand[i]=UARTCtrl->Rand[i];//抄表安全模式时发送给电表的16字节随机数
	}
	for(i=0;i<LEN_RMCSD;i++)
	{
		RMLIST->List[ListNo].RMCSD[i]=UARTCtrl->RMCSD[i];//128-x byte 当前正在抄的CSD(有数据类型)
	}
	
//FnData
	//i=Get_ADDR_UARTnFnDataBuff(PORTn);
	//MW(i,(u32)&RMLIST->List[ListNo].FnDataBuff,LEN_UART4FnDataBuff);
//抄表数据缓冲1,最大总长度=LEN_RM_DI_CSD
//0 6byte 电能表地址
//6 2byte 长度=时标+已采集的CSD(不包括本身2字节)
//8 7byte 采集启动时标  date_time_s(无数据类型)
//15 7byte 采集成功时标  date_time_s(无数据类型)
//22 7byte 采集存储时标  date_time_s(无数据类型)
//29  采集的CSD  array CSD(有数据类型)
	p8=(u8*)Get_ADDR_UARTnFnDataBuff(PORTn);
	i=p8[6];//长度=时标+已采集的CSD(不包括本身2字节)
	i|=p8[7]<<8;
	i+=8;
	if(i>LEN_RM_DI_CSD)
	{
		i=LEN_RM_DI_CSD;
	}
	MW((u32)p8,(u32)&RMLIST->List[ListNo].FnDataBuff,i);
//抄表数据缓冲2,最大总长度=LEN_UARTnFnDataBuff-LEN_RM_DI_CSD
//LEN_RM_DI_CSD   2byte 长度=已填写入buff但还没完整一个CSD的长度(不包括本身2字节)
//LEN_RM_DI_CSD+2 2byte 长度=已填写入buff完整CSD的长度(不包括本身2字节)
//LEN_RM_DI_CSD+4 采集的数据(有数据类型,全部数据为单独顺序排列无总数组)
	i=p8[LEN_RM_DI_CSD];
	i|=p8[LEN_RM_DI_CSD+1]<<8;
	x=p8[LEN_RM_DI_CSD+2];
	x|=p8[LEN_RM_DI_CSD+3]<<8;
	i+=x;
	i+=4;
	if(i>(LEN_UART4FnDataBuff-LEN_RM_DI_CSD))
	{
		i=LEN_UART4FnDataBuff-LEN_RM_DI_CSD;
	}
	MW((u32)p8+LEN_RM_DI_CSD,(u32)&RMLIST->List[ListNo].FnDataBuff+LEN_RM_DI_CSD,i);
}




void RM_3762_RouterActive(u32 PORTn)//载波抄表(路由模块主导的周期抄表模式)
{
	u32 i;
	u32 LEN_DATA;
	u32 Info;
	u8* p8rx;
	u8* p8tx;
	u64 d64a;
//	u64 d64b;
	u16* p16timer;
	u32 SetNo;
	u32 RMListNO;
  UARTCtrl_TypeDef* UARTCtrl;
	u32 NUM_SomeTaskID;
	u32 y;
	
	NUM_SomeTaskID=NUM_SomeTaskID;
	y=y;
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	
