gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762_RouterActive.c
					#if NUM_RMLISTmax<NUM_RMmax//载波路由主动抄表时用的最大抄表能缓存个数(抄表计数、已抄数据填入等)
						RMListNO=Get_RMListNO_Rx((u16*)&UARTCtrl->RMAddr);//得到当前抄表地址的列表号0-(NUM_RMLISTmax-1),当原没列表时返回:NUM_RMLISTmax表示无效
						if(RMListNO>=NUM_RMLISTmax)
						{//没找到
							goto RXESC;
						}
					#else
						RMListNO=SetNo;
					#endif
						
						Load_RMCount_CompAddr(PORTn,RMListNO);//得到抄表计数相关数据(比较地址);入口:ListNo=列表号从0开始
						for(i=0;i<LEN_DATA;i++)
						{//去返回645帧的前导0xfe
							if(p8rx[i]!=0xfe)
							{
								if(i!=0)
								{
									MR((u32)p8rx,((u32)p8rx)+i,LEN_DATA-i);
								}
								break;
							}
						}
						i=RM_RxDATA_CHECK(PORTn);//帧接收数据检查,比较发收地址、控制码、数据标识、减0x33;返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
						if((i==1)||(i==3))
						{//1地址错,3数据标识错
							//UARTCtrl->Task=2;//2=接收超时(或错误)
							Save_RMCount(PORTn,RMListNO);//得到抄表计数相关数据;入口:SetNo=档案号从0开始
							goto RXESC;
						}
						if(i==4)
						{//4主动上报(已处理)
							Save_RMCount(PORTn,RMListNO);//得到抄表计数相关数据;入口:SetNo=档案号从0开始
							goto RXESC;
						}
						UARTCtrl->RM_Rx_date_NULL=i;//抄表接收返回:0=有数据,!=0无数据(空数据)
						if(i==2)
						{//2控制码错(无数据)
//							UARTCtrl->RMCSDSubCount++;//抄表CSD子计数
//							UARTCtrl->ReRMCount=0;//抄表重发计数
//							Save_RMCount(PORTn,RMListNO);//得到抄表计数相关数据;入口:SetNo=档案号从0开始
//							goto RXESC;
						#if (USER/100)==15//安徽
							//安徽:针对三相表需要支持06000001和061000FF等块抄读
							if(UARTCtrl->RM_DI==0x06000001)
							{
								//UARTCtrl->Task=2;//2=接收超时(或错误)
								Save_RMCount(PORTn,RMListNO);//得到抄表计数相关数据;入口:SetNo=档案号从0开始
								goto RXESC;
							}
						#endif
							//曲线等冻结数据当指定时间点无数据冻结时写入空数据避免补抄时重新抄读
							i=(UARTCtrl->RMCSD[2]<<8)|UARTCtrl->RMCSD[3];
							Info=(UARTCtrl->TaskID>>20)&0xf;//采集类型
							if(!((i==0x5002)||(Info==4)))
							{//不是抄分钟冻结(采曲线数据)和补抄(2=事件采集方案时会填入空数据而上报)
								UARTCtrl->RMCSDSubCount++;//抄表CSD子计数
								UARTCtrl->ReRMCount=0;//抄表重发计数
								Save_RMCount(PORTn,RMListNO);//得到抄表计数相关数据;入口:SetNo=档案号从0开始
								goto RXESC;
							}
						}
						RM_RxDATA(PORTn);//抄表接收数据处理
						RM_State_RMUpDate(PORTn,1,SetNo,(Info>>4)&0xf,(Info>>16)&0xf);//采集状态,每次抄表后更新:入口:OK=0失败=1成功,OK=1时Class=中继级别,Phase=相位
						
						UARTCtrl->ReRMCount=0;//抄表重发计数
						UARTCtrl->RMCSDSubCount++;//抄表CSD子计数
						Save_RMCount(PORTn,RMListNO);//得到抄表计数相关数据;入口:SetNo=档案号从0开始
						//发确认回答上报抄表数据
					RXESC:
						MWR(0xffffffff,((u32)p8tx)+128,6);
						Uart_3762_TxData(PORTn,0,1,6);//376.2发送数据填入发送区,入口时若有信息域目的地址数据单元等则已填入,数据单元暂固定填入发送缓冲区+128地址
						if(Terminal_Router->RouterRunMode_1==2)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
						{
							p8tx[3]=0x03;//控制码;集中式路由载波通信
						}
						else
						{
							if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
							{
								p8tx[3]=0x0a;//控制码;微功率无线通信
							}
							else
							{
								p8tx[3]=0x01;//控制码;集中式路由载波通信
							}
						}
						Uart_3762_CS((u32)p8tx);//和校验计算并写入(同时写入结束0x16)和比较,返回0=正确1=错误,入口接收或发送缓冲
						break;
					default:
						UARTCtrl->RxByte=0;//接收字节数(半字对齐)
						UARTCtrl->Task=5;//正在接收
						break;
				}
			}
			return;
	}
}
#endif


